Important Libraries

In [2]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import sklearn as sk

Loading the data

In [3]:
df = pd.read_csv("data/runners.csv")
df

   RunnerId     Name Gender    Age
0         1    Peter      M  35-39
1         2    Jenny      F  30-34
2         3  Heather      F  25-29
3         4     John      M  30-34
4         5      Max      M  35-39
5         6    Julie      F  40-44

Word length function

In [2]:
def word_length(words):
    wl = {w: len(w) for w in words}

    # replace with your code

    # return the dictionary of word lengths
    return wl


word_length(["basmah", "amma", "rabah","ozair","ahmed"])

{'basmah': 6, 'amma': 4, 'rabah': 5, 'ozair': 5, 'ahmed': 5}

Longest words function

In [1]:
def longest_word(words):
    if len(words) != 2:
        mess = print("Sorry. Please provide exactly two words to compare")
    elif len(words[0]) > len(words[1]):
        mess = print("The first word is longest,", len(words[0]), ">", len(words[1]))
    elif len(words[0]) < len(words[1]):
        mess = print("The second word is longest,", len(words[0]), "<", len(words[1]))
    elif len(words[0]) == len(words[1]):
        mess = print("Both words are 6 characters long")
    
    return mess  # return message


longest_word(["mouse", "king"])  # should return "The first word is longest, 5 > 4"
longest_word(["tax", "house"])  # should return "The second word is longest, 3 < 5"
longest_word(["purple", "orange"])  # should return "Both words are 6 characters long"
longest_word(
    ["purple", "orange", "red"]
)  # should return "Sorry. Please provide exactly two words to compare"


longest_word(["jiminy","jack"])

The first word is longest, 5 > 4
The second word is longest, 3 < 5
Both words are 6 characters long
Sorry. Please provide exactly two words to compare
The first word is longest, 6 > 4

Shortest Word using word_length function

In [4]:
def shortest_word(words):
    x = word_length(words)
    a = []
    for i in x.values():
        a.append(i)
   
    return min(a)


print(shortest_word(["mouse", "king"]))  # should return 4
print(shortest_word(["tax", "house"]) ) # should return 3
print(shortest_word(["purple", "orange"]))  # should return 6

4
3
6

Indexing

In [4]:
#All
df[:]

#Semi color means "x TO y" (y not inclusive)

   RunnerId     Name Gender    Age
0         1    Peter      M  35-39
1         2    Jenny      F  30-34
2         3  Heather      F  25-29
3         4     John      M  30-34
4         5      Max      M  35-39
5         6    Julie      F  40-44

In [5]:
#From first index till 2nd item (0 and 1, 2 not included)

df[0:2]

   RunnerId   Name Gender    Age
0         1  Peter      M  35-39
1         2  Jenny      F  30-34

In [6]:
#iloc will display rows

df.iloc[0:2]

   RunnerId   Name Gender    Age
0         1  Peter      M  35-39
1         2  Jenny      F  30-34

In [7]:
#iloc displaying all rows, and columns 0 and 1
df.iloc[:,[0,1]]

   RunnerId     Name
0         1    Peter
1         2    Jenny
2         3  Heather
3         4     John
4         5      Max
5         6    Julie

Filtering

In [8]:
df.loc[(df.RunnerId > 1) & (df.Gender == "F")]

   RunnerId     Name Gender    Age
1         2    Jenny      F  30-34
2         3  Heather      F  25-29
5         6    Julie      F  40-44

In [9]:
df[(df.RunnerId == 1) & (df.Gender == "M")]

   RunnerId   Name Gender    Age
0         1  Peter      M  35-39

Grouping summaries

In [10]:
#grouping by genders and counting unique ages

df.groupby('Gender')['Age'].agg('count')

Gender
F    3
M    3
Name: Age, dtype: int64

In [11]:
#can use multiple arguments in list
df.groupby('Gender')['RunnerId'].agg(['count','min','max','mean','std'])

        count  min  max      mean       std
Gender
F           3    2    6  3.666667  2.081666
M           3    1    5  3.333333  2.081666

Columns

In [12]:
df.columns

Index(['RunnerId', 'Name', 'Gender', 'Age'], dtype='object')

Value Counts

In [13]:
df.value_counts()

RunnerId  Name     Gender  Age
1         Peter    M       35-39    1
2         Jenny    F       30-34    1
3         Heather  F       25-29    1
4         John     M       30-34    1
5         Max      M       35-39    1
6         Julie    F       40-44    1
dtype: int64

Value Counts with Proportions

In [14]:
df.RunnerId.value_counts(normalize=True, dropna=False)

1    0.166667
2    0.166667
3    0.166667
4    0.166667
5    0.166667
6    0.166667
Name: RunnerId, dtype: float64

Converting column dtypes

In [15]:
df["RunnerId"] = df["RunnerId"].astype(int)
df.RunnerId

0    1
1    2
2    3
3    4
4    5
5    6
Name: RunnerId, dtype: int64

For Loops with if statement

In [16]:
a = df.RunnerId
b = []
c = []
for i in a:
    if i > 2:
        c.append(i)
    elif i <= 2:
        b.append(i)


print(b,c)

[1, 2] [3, 4, 5, 6]

List Comprehensions

In [17]:
fruits = ["apple", "banana", "cherry", "kiwi", "mango"]

newlist = [x for x in fruits if "n" in x]
newlist

['banana', 'mango']

Dictionary Comprehensions

In [18]:
keys = ['a','b','c','d','e']
values = [1,2,3,4,5] 
 
# but this line shows dict comprehension here 
myDict = { k:v for (k,v) in zip(keys, values)} 


myDict

{'a': 1, 'b': 2, 'c': 3, 'd': 4, 'e': 5}

In [19]:
myDict = {x: x**2 for x in [1,2,3,4,5]}
myDict

{1: 1, 2: 4, 3: 9, 4: 16, 5: 25}

In [20]:

sDict = {x.upper(): x*3 for x in 'coding '}
print (sDict)

{'C': 'ccc', 'O': 'ooo', 'D': 'ddd', 'I': 'iii', 'N': 'nnn', 'G': 'ggg', ' ': '   '}